tests/xml/200_create_invoice_reservation_simple.xml

<?xml version="1.0"?>
<APIResponse version="20151228">
    <Header>
        <Date>2016-06-13T14:37:45+02:00</Date>
        <Path>API/createInvoiceReservation</Path>
        <ErrorCode>0</ErrorCode>
        <ErrorMessage/>
    </Header>
    <Body>
        <Result>Success</Result>
        <Transactions>
            <Transaction>
                <TransactionId>363</TransactionId>
                <PaymentId>473173b2-5ce3-4824-96a4-d1889a6b9e14</PaymentId>
                <AuthType>payment</AuthType>
                <CardStatus>NoCreditCard</CardStatus>
                <CreditCardToken/>
                <CreditCardMaskedPan/>
                <ThreeDSecureResult>Not_Applicable</ThreeDSecureResult>
                <LiableForChargeback>Merchant</LiableForChargeback>
                <CVVCheckResult>Not_Applicable</CVVCheckResult>
                <BlacklistToken/>
                <ShopOrderId>111222333</ShopOrderId>
                <Shop>AltaPay Functional Test Shop</Shop>
                <Terminal>AltaPay Test Invoice Terminal DK</Terminal>
                <TransactionStatus>invoice_initialized</TransactionStatus>
                <ReasonCode>NONE</ReasonCode>
                <MerchantCurrency>208</MerchantCurrency>
                <MerchantCurrencyAlpha>DKK</MerchantCurrencyAlpha>
                <CardHolderCurrency>208</CardHolderCurrency>
                <CardHolderCurrencyAlpha>DKK</CardHolderCurrencyAlpha>
                <ReservedAmount>133.33</ReservedAmount>
                <CapturedAmount>0.00</CapturedAmount>
                <RefundedAmount>0.00</RefundedAmount>
                <CreditedAmount>0.00</CreditedAmount>
                <RecurringDefaultAmount>0.00</RecurringDefaultAmount>
                <SurchargeAmount>0.00</SurchargeAmount>
                <CreatedDate>2016-06-13 14:37:45</CreatedDate>
                <UpdatedDate>2016-06-13 14:37:45</UpdatedDate>
                <PaymentNature>Invoice</PaymentNature>
                <PaymentSource>eCommerce</PaymentSource>
                <PaymentSchemeName>Test Invoice</PaymentSchemeName>
                <PaymentNatureService name="TestInvoiceAcquirer">
                    <SupportsRefunds>true</SupportsRefunds>
                    <SupportsRelease>true</SupportsRelease>
                    <SupportsMultipleCaptures>true</SupportsMultipleCaptures>
                    <SupportsMultipleRefunds>true</SupportsMultipleRefunds>
                </PaymentNatureService>
                <ChargebackEvents/>
                <PaymentInfos/>
                <CustomerInfo>
                    <UserAgent/>
                    <IpAddress/>
                    <Email>
                        <![CDATA[foo@bar.com]]>
                    </Email>
                    <Username/>
                    <CustomerPhone/>
                    <OrganisationNumber/>
                    <CountryOfOrigin>
                        <Country/>
                        <Source>NotSet</Source>
                    </CountryOfOrigin>
                    <BillingAddress>
                        <Firstname/>
                        <Lastname/>
                        <Address>
                            <![CDATA[Address 12]]>
                        </Address>
                        <City/>
                        <Region/>
                        <Country/>
                        <PostalCode>
                            <![CDATA[9400]]>
                        </PostalCode>
                    </BillingAddress>
                    <RegisteredAddress>
                        <Firstname/>
                        <Lastname/>
                        <Address>
                            <![CDATA[Address 12]]>
                        </Address>
                        <City/>
                        <Region/>
                        <Country/>
                        <PostalCode>
                            <![CDATA[9400]]>
                        </PostalCode>
                    </RegisteredAddress>
                </CustomerInfo>
                <ReconciliationIdentifiers/>
            </Transaction>
        </Transactions>
    </Body>
</APIResponse>
